[
	"Nantucket's best burgers are at the Brotherhood, but watch your head on the way in.",
	"Nantucket means \"faraway land\" in the language of the original natives, the Wampanoag tribe.",
	"Harvesting scallops is a family tradition each fall on Nantucket.",
	"Nantucket is an island, a county, and a town.  It's the only U.S. place with the same name for all 3.",
	"The first ship built on Nantucket was named \"Rose\".",
	"Shell Street in Siasconset is too narrow for cars and bikes.",
	"In 1857, cobblestones were laid in Nantucket to help prevent wagon wheels from sinking into the sand.",
	"The Nantucket High School sports teams are known as the Whalers.",
	"Nantucket's Brent Point is the second oldest lighthouse in the U.S., built in 1746.",
	"There are buses, but no fixed bus route on Nantucket.",
	"On March 7th, 1970, a total solar eclipse on Nantucket lasted 2 minutes and 6 seconds.  The temperature dropped 10 degrees.",
	"Nantucket is 30 miles off the coast of Hyannis, Massachusetts.",
	"Nantucketers are famed for their \"gams\", a term for their colorful social conversations.",
	"In the 1960's Nantucket and Martha's Vineyard considered seceding from the Commonwealth of Massachusetts.",
	"Cisco Brewery's Triple 8 party on Nantucket is always at 8pm on 8/8.",
	"Nantucket's annual Island Fair features pumpkin contests, vegetable judging, and an exotic animal show.",
	"Nantucket's whaling dominance was part of the literary classic, \"Moby Dick\".",
	"The town of Nantucket has two stone markers that indicate the north and south lines of town.",
	"The Nantucket flag is called a burgee, a distinctively-shaped flag normally used on ships.",
	"Commercial flights started for Nantucket in 1927.",
	"The end of Broad Street by Steamship Wharf is known as \"the strip\" on Nantucket.",
	"Nantucket has over 82 miles of beaches.",
	"There are no parking meters on Nantucket.",
	"Nantucket is the home to the Nantucket Film Festival, an annual event.",
	"In February 1905, Nantucket Harbor froze solid for 3 weeks and the steamship Nantucket was stuck.",
	"Nantucket has two local newspapers, but no local radio station.",
	"Nantucketers moving to the mainland in the 18th Century often disassembled their island homes and took them along off island.",
	"Nantucket was a part of New York from 1660 to 1692.",
	"Nantucket is world-known for its sports fishing of stripers, bluefish, bonito and false albacore.",
	"Nantucket is the 2nd easternmost point in the continental U.S.A.",
	"Nantucket's annual Chowder Contest takes place in October.",
	"Following a 1921 shipwreck, islanders collected coconut oil by the ton off Nantucket's easter shores and used it to make soap.",
	"Nantucket lighthouse baskets were first made on the island over 150 years ago.",
	"Between 5,000 and 7,000 grey seals live off the coast of Nantucket.",
	"Nantucket does not allow neon lights on the island.",
	"Nantucket was created 50-70,000 years ago during the Earth's last glacial era.",
	"In 1963 it cost about $20 to fly from Nantucket to New York.",
	"Wandering around Nantucket is commonly called \"rantum scooting\" by the natives.",
	"The first Iron Teams Relay event on Nantucket was held on June 21, 1981.",
	"One can see seals off the coast of Nantucket.",
	"The Hummock Pond Boys are a mysterious group of Nantucketers who make anonymous donations to charities.",
	"In 1968, a new steeple was lowered by helicopter onto The Congregational Church on Nantucket.",
	"In 1983, the original copper dome of the Great Point Lighthouse was knocked over by a storm.",
	"The highest point on Nantucket is Folger Hill. It is 109 feet above sea level.",
	"The \"Turkey Terrific\" sandwich from Provisions on Nantucket has become an island tradition for lunch.",
	"Nantucketers discovered whaling by accident when a \"scrag\" whale found its way into the harbor.",
	"Nantucket's Straight Wharf was built in 1723 and was the focal marina for the whaling industry.",
	"Nantucket has the highest number of rare species anywhere in Massachusetts.",
	"Nantucket attracts well over one million tourists each year.",
	"Nantucket's Whaling Museum first opened in the summer of 1930.",
	"Nantucket was the world's leading whaling port until 1840.",
	"Because of natural erosion, the Skankaty Lighthouse on Nantucket is in peril of falling into the sea.",
	"Nantucket is approximately 300,000 acres.",
	"There are over 1000 acres of farmland on Nantucket.",
	"By 1900, there were no more Quakers, a once dominant group on Nantucket.",
	"The body of water between Martha's Vineyard and Nantucket is the Muskeget Channel",
	"The best whale watching off of Nantucket happens in July and August.",
	"At one time, Nantucket had seven streets named Atlantic Avenue.",
	"Many say that the best sunsets on Nantucket can be seen on Madaket Beach.",
	"There are about 12,000 full-time residents of Nantucket.",
	"Islanders gathered in the Great Hall of the Atheneum for the first long distance call to the mainland on August 29, 1916.",
	"Bartholomew Gosnold was credited in \"discovering\" Nantucket in 1602.",
	"In late April, millions of daffodils bloom on Nantucket.",
	"Cranberries were first cultivated on Nantucket in 1857.",
	"In the 1770's there were more than 2200 Quakers on Nantucket, by 1831 there were 450.",
	"Dionis Beach in northern Nantucket was named for Dionis Coffin, an early settler of the island.",
	"There are two adjoining islands to Nantucket: Tuckernuck and Muskeget.",
	"Island Tours on Nantucket experiences its highest volume in August.",
	"Cars were not allowed on Nantucket until 1918.",
	"The popular Nantucket Reds pants originated at Murray's Toggery Shop on Nantucket.",
	"Nantucket's first two public schools were established in 1827.",
	"The Old Mill on Nantucket was built in 1746 and still produces coarse-ground cornmeal.",
	"Part of the 1950s classic movie \"Cheaper by the Dozen\", takes place on Nantucket.",
	"A five-person board of selectmen is elected to govern Nantucket.",
	"In 1932, a prisoner in a Nantucket jail was smuggled off the island in a laundry cart.",
	"In 2001, Nantucket's year-round population made up about 0.15% of the total population of Massachusetts.",
	"Nantucket is also known as the Grey Lady because the fog that frequently surrounds the island.",
	"There are two historical districts on Nantucket: the Old Historic and the Sconset.",
	"There are 44 steps at Steps Beach on Nantucket."
]